GopalSaraf/Practicals/PSDL/include/proc/pic16f18126.h
// Register: PWM2CON
#define PWM2CON PWM2CON
extern volatile unsigned char           PWM2CON             __at(0x515);
#ifndef _LIB_BUILD
asm("PWM2CON equ 0515h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ERSNOW                 :1;
        unsigned ERSPOL                 :1;
        unsigned LD                     :1;
        unsigned                        :4;
        unsigned EN                     :1;
    };
} PWM2CONbits_t;
extern volatile PWM2CONbits_t PWM2CONbits __at(0x515);
// bitfield macros
#define _PWM2CON_ERSNOW_POSN                                0x0
#define _PWM2CON_ERSNOW_POSITION                            0x0
#define _PWM2CON_ERSNOW_SIZE                                0x1
#define _PWM2CON_ERSNOW_LENGTH                              0x1
#define _PWM2CON_ERSNOW_MASK                                0x1
#define _PWM2CON_ERSPOL_POSN                                0x1
#define _PWM2CON_ERSPOL_POSITION                            0x1
#define _PWM2CON_ERSPOL_SIZE                                0x1
#define _PWM2CON_ERSPOL_LENGTH                              0x1
#define _PWM2CON_ERSPOL_MASK                                0x2
#define _PWM2CON_LD_POSN                                    0x2
#define _PWM2CON_LD_POSITION                                0x2
#define _PWM2CON_LD_SIZE                                    0x1
#define _PWM2CON_LD_LENGTH                                  0x1
#define _PWM2CON_LD_MASK                                    0x4
#define _PWM2CON_EN_POSN                                    0x7
#define _PWM2CON_EN_POSITION                                0x7
#define _PWM2CON_EN_SIZE                                    0x1
#define _PWM2CON_EN_LENGTH                                  0x1
#define _PWM2CON_EN_MASK                                    0x80

// Register: PWM2S1CFG
#define PWM2S1CFG PWM2S1CFG
extern volatile unsigned char           PWM2S1CFG           __at(0x516);
#ifndef _LIB_BUILD
asm("PWM2S1CFG equ 0516h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned PPEN                   :1;
        unsigned                        :2;
        unsigned POL1                   :1;
        unsigned POL2                   :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
} PWM2S1CFGbits_t;
extern volatile PWM2S1CFGbits_t PWM2S1CFGbits __at(0x516);
// bitfield macros
#define _PWM2S1CFG_MODE_POSN                                0x0
#define _PWM2S1CFG_MODE_POSITION                            0x0
#define _PWM2S1CFG_MODE_SIZE                                0x3
#define _PWM2S1CFG_MODE_LENGTH                              0x3
#define _PWM2S1CFG_MODE_MASK                                0x7
#define _PWM2S1CFG_PPEN_POSN                                0x3
#define _PWM2S1CFG_PPEN_POSITION                            0x3
#define _PWM2S1CFG_PPEN_SIZE                                0x1
#define _PWM2S1CFG_PPEN_LENGTH                              0x1
#define _PWM2S1CFG_PPEN_MASK                                0x8
#define _PWM2S1CFG_POL1_POSN                                0x6
#define _PWM2S1CFG_POL1_POSITION                            0x6
#define _PWM2S1CFG_POL1_SIZE                                0x1
#define _PWM2S1CFG_POL1_LENGTH                              0x1
#define _PWM2S1CFG_POL1_MASK                                0x40
#define _PWM2S1CFG_POL2_POSN                                0x7
#define _PWM2S1CFG_POL2_POSITION                            0x7
#define _PWM2S1CFG_POL2_SIZE                                0x1
#define _PWM2S1CFG_POL2_LENGTH                              0x1
#define _PWM2S1CFG_POL2_MASK                                0x80
#define _PWM2S1CFG_MODE0_POSN                               0x0
#define _PWM2S1CFG_MODE0_POSITION                           0x0
#define _PWM2S1CFG_MODE0_SIZE                               0x1
#define _PWM2S1CFG_MODE0_LENGTH                             0x1
#define _PWM2S1CFG_MODE0_MASK                               0x1
#define _PWM2S1CFG_MODE1_POSN                               0x1
#define _PWM2S1CFG_MODE1_POSITION                           0x1
#define _PWM2S1CFG_MODE1_SIZE                               0x1
#define _PWM2S1CFG_MODE1_LENGTH                             0x1
#define _PWM2S1CFG_MODE1_MASK                               0x2
#define _PWM2S1CFG_MODE2_POSN                               0x2
#define _PWM2S1CFG_MODE2_POSITION                           0x2
#define _PWM2S1CFG_MODE2_SIZE                               0x1
#define _PWM2S1CFG_MODE2_LENGTH                             0x1
#define _PWM2S1CFG_MODE2_MASK                               0x4

// Register: PWM2S1P1
#define PWM2S1P1 PWM2S1P1
extern volatile unsigned short          PWM2S1P1            __at(0x517);
#ifndef _LIB_BUILD
asm("PWM2S1P1 equ 0517h");
#endif

// Register: PWM2S1P1L
#define PWM2S1P1L PWM2S1P1L
extern volatile unsigned char           PWM2S1P1L           __at(0x517);
#ifndef _LIB_BUILD
asm("PWM2S1P1L equ 0517h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1L                    :8;
    };
    struct {
        unsigned S1P1L                  :8;
    };
} PWM2S1P1Lbits_t;
extern volatile PWM2S1P1Lbits_t PWM2S1P1Lbits __at(0x517);
// bitfield macros
#define _PWM2S1P1L_P1L_POSN                                 0x0
#define _PWM2S1P1L_P1L_POSITION                             0x0
#define _PWM2S1P1L_P1L_SIZE                                 0x8
#define _PWM2S1P1L_P1L_LENGTH                               0x8
#define _PWM2S1P1L_P1L_MASK                                 0xFF
#define _PWM2S1P1L_S1P1L_POSN                               0x0
#define _PWM2S1P1L_S1P1L_POSITION                           0x0
#define _PWM2S1P1L_S1P1L_SIZE                               0x8
#define _PWM2S1P1L_S1P1L_LENGTH                             0x8
#define _PWM2S1P1L_S1P1L_MASK                               0xFF

// Register: PWM2S1P1H
#define PWM2S1P1H PWM2S1P1H
extern volatile unsigned char           PWM2S1P1H           __at(0x518);
#ifndef _LIB_BUILD
asm("PWM2S1P1H equ 0518h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1H                    :8;
    };
    struct {
        unsigned S1P1H                  :8;
    };
} PWM2S1P1Hbits_t;
extern volatile PWM2S1P1Hbits_t PWM2S1P1Hbits __at(0x518);
// bitfield macros
#define _PWM2S1P1H_P1H_POSN                                 0x0
#define _PWM2S1P1H_P1H_POSITION                             0x0
#define _PWM2S1P1H_P1H_SIZE                                 0x8
#define _PWM2S1P1H_P1H_LENGTH                               0x8
#define _PWM2S1P1H_P1H_MASK                                 0xFF
#define _PWM2S1P1H_S1P1H_POSN                               0x0
#define _PWM2S1P1H_S1P1H_POSITION                           0x0
#define _PWM2S1P1H_S1P1H_SIZE                               0x8
#define _PWM2S1P1H_S1P1H_LENGTH                             0x8
#define _PWM2S1P1H_S1P1H_MASK                               0xFF

