GopalSaraf/Practicals/PSDL/include/proc/pic16f18126.h
extern volatile __bit                   NCO1INC19           __at(0x2C8B);	// @ (0x591 * 8 + 3)
#define                                 NCO1INC19_bit       _BIT_ACCESS(NCO1INCU,3)
// NCO1INCL<NCO1INC2>
extern volatile __bit                   NCO1INC2            __at(0x2C7A);	// @ (0x58F * 8 + 2)
#define                                 NCO1INC2_bit        _BIT_ACCESS(NCO1INCL,2)
// NCO1INCL<NCO1INC3>
extern volatile __bit                   NCO1INC3            __at(0x2C7B);	// @ (0x58F * 8 + 3)
#define                                 NCO1INC3_bit        _BIT_ACCESS(NCO1INCL,3)
// NCO1INCL<NCO1INC4>
extern volatile __bit                   NCO1INC4            __at(0x2C7C);	// @ (0x58F * 8 + 4)
#define                                 NCO1INC4_bit        _BIT_ACCESS(NCO1INCL,4)
// NCO1INCL<NCO1INC5>
extern volatile __bit                   NCO1INC5            __at(0x2C7D);	// @ (0x58F * 8 + 5)
#define                                 NCO1INC5_bit        _BIT_ACCESS(NCO1INCL,5)
// NCO1INCL<NCO1INC6>
extern volatile __bit                   NCO1INC6            __at(0x2C7E);	// @ (0x58F * 8 + 6)
#define                                 NCO1INC6_bit        _BIT_ACCESS(NCO1INCL,6)
// NCO1INCL<NCO1INC7>
extern volatile __bit                   NCO1INC7            __at(0x2C7F);	// @ (0x58F * 8 + 7)
#define                                 NCO1INC7_bit        _BIT_ACCESS(NCO1INCL,7)
// NCO1INCH<NCO1INC8>
extern volatile __bit                   NCO1INC8            __at(0x2C80);	// @ (0x590 * 8 + 0)
#define                                 NCO1INC8_bit        _BIT_ACCESS(NCO1INCH,0)
// NCO1INCH<NCO1INC9>
extern volatile __bit                   NCO1INC9            __at(0x2C81);	// @ (0x590 * 8 + 1)
#define                                 NCO1INC9_bit        _BIT_ACCESS(NCO1INCH,1)
// PMD2<NCO1MD>
extern volatile __bit                   NCO1MD              __at(0x873);	// @ (0x10E * 8 + 3)
#define                                 NCO1MD_bit          _BIT_ACCESS(PMD2,3)
// NCO1CON<NCO1OUT>
extern volatile __bit                   NCO1OUT             __at(0x2C95);	// @ (0x592 * 8 + 5)
#define                                 NCO1OUT_bit         _BIT_ACCESS(NCO1CON,5)
// NCO1CON<NCO1PFM>
extern volatile __bit                   NCO1PFM             __at(0x2C90);	// @ (0x592 * 8 + 0)
#define                                 NCO1PFM_bit         _BIT_ACCESS(NCO1CON,0)
// NCO1CON<NCO1POL>
extern volatile __bit                   NCO1POL             __at(0x2C94);	// @ (0x592 * 8 + 4)
#define                                 NCO1POL_bit         _BIT_ACCESS(NCO1CON,4)
// NCO1CLK<NCO1PWS0>
extern volatile __bit                   NCO1PWS0            __at(0x2C9D);	// @ (0x593 * 8 + 5)
#define                                 NCO1PWS0_bit        _BIT_ACCESS(NCO1CLK,5)
// NCO1CLK<NCO1PWS1>
extern volatile __bit                   NCO1PWS1            __at(0x2C9E);	// @ (0x593 * 8 + 6)
#define                                 NCO1PWS1_bit        _BIT_ACCESS(NCO1CLK,6)
// NCO1CLK<NCO1PWS2>
extern volatile __bit                   NCO1PWS2            __at(0x2C9F);	// @ (0x593 * 8 + 7)
#define                                 NCO1PWS2_bit        _BIT_ACCESS(NCO1CLK,7)
// OSCCON1<NDIV0>
extern volatile __bit                   NDIV0               __at(0x1468);	// @ (0x28D * 8 + 0)
#define                                 NDIV0_bit           _BIT_ACCESS(OSCCON1,0)
// OSCCON1<NDIV1>
extern volatile __bit                   NDIV1               __at(0x1469);	// @ (0x28D * 8 + 1)
#define                                 NDIV1_bit           _BIT_ACCESS(OSCCON1,1)
// OSCCON1<NDIV2>
extern volatile __bit                   NDIV2               __at(0x146A);	// @ (0x28D * 8 + 2)
#define                                 NDIV2_bit           _BIT_ACCESS(OSCCON1,2)
// OSCCON1<NDIV3>
extern volatile __bit                   NDIV3               __at(0x146B);	// @ (0x28D * 8 + 3)
#define                                 NDIV3_bit           _BIT_ACCESS(OSCCON1,3)
// OSCCON1<NOSC0>
extern volatile __bit                   NOSC0               __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 NOSC0_bit           _BIT_ACCESS(OSCCON1,4)
// OSCCON1<NOSC1>
extern volatile __bit                   NOSC1               __at(0x146D);	// @ (0x28D * 8 + 5)
#define                                 NOSC1_bit           _BIT_ACCESS(OSCCON1,5)
// OSCCON1<NOSC2>
extern volatile __bit                   NOSC2               __at(0x146E);	// @ (0x28D * 8 + 6)
#define                                 NOSC2_bit           _BIT_ACCESS(OSCCON1,6)
// OSCCON3<NOSCR>
extern volatile __bit                   NOSCR               __at(0x147B);	// @ (0x28F * 8 + 3)
#define                                 NOSCR_bit           _BIT_ACCESS(OSCCON3,3)
// NVMADRL<NVMADR0>
extern volatile __bit                   NVMADR0             __at(0xE460);	// @ (0x1C8C * 8 + 0)
#define                                 NVMADR0_bit         _BIT_ACCESS(NVMADRL,0)
// NVMADRL<NVMADR1>
extern volatile __bit                   NVMADR1             __at(0xE461);	// @ (0x1C8C * 8 + 1)
#define                                 NVMADR1_bit         _BIT_ACCESS(NVMADRL,1)
// NVMADRH<NVMADR10>
extern volatile __bit                   NVMADR10            __at(0xE46A);	// @ (0x1C8D * 8 + 2)
#define                                 NVMADR10_bit        _BIT_ACCESS(NVMADRH,2)
// NVMADRH<NVMADR11>
extern volatile __bit                   NVMADR11            __at(0xE46B);	// @ (0x1C8D * 8 + 3)
#define                                 NVMADR11_bit        _BIT_ACCESS(NVMADRH,3)
// NVMADRH<NVMADR12>
extern volatile __bit                   NVMADR12            __at(0xE46C);	// @ (0x1C8D * 8 + 4)
#define                                 NVMADR12_bit        _BIT_ACCESS(NVMADRH,4)
// NVMADRH<NVMADR13>
extern volatile __bit                   NVMADR13            __at(0xE46D);	// @ (0x1C8D * 8 + 5)
#define                                 NVMADR13_bit        _BIT_ACCESS(NVMADRH,5)
// NVMADRH<NVMADR14>
extern volatile __bit                   NVMADR14            __at(0xE46E);	// @ (0x1C8D * 8 + 6)
#define                                 NVMADR14_bit        _BIT_ACCESS(NVMADRH,6)
// NVMADRL<NVMADR2>
extern volatile __bit                   NVMADR2             __at(0xE462);	// @ (0x1C8C * 8 + 2)
#define                                 NVMADR2_bit         _BIT_ACCESS(NVMADRL,2)
// NVMADRL<NVMADR3>
extern volatile __bit                   NVMADR3             __at(0xE463);	// @ (0x1C8C * 8 + 3)
#define                                 NVMADR3_bit         _BIT_ACCESS(NVMADRL,3)
// NVMADRL<NVMADR4>
extern volatile __bit                   NVMADR4             __at(0xE464);	// @ (0x1C8C * 8 + 4)
#define                                 NVMADR4_bit         _BIT_ACCESS(NVMADRL,4)
// NVMADRL<NVMADR5>
extern volatile __bit                   NVMADR5             __at(0xE465);	// @ (0x1C8C * 8 + 5)
#define                                 NVMADR5_bit         _BIT_ACCESS(NVMADRL,5)
// NVMADRL<NVMADR6>
extern volatile __bit                   NVMADR6             __at(0xE466);	// @ (0x1C8C * 8 + 6)
#define                                 NVMADR6_bit         _BIT_ACCESS(NVMADRL,6)
// NVMADRL<NVMADR7>
extern volatile __bit                   NVMADR7             __at(0xE467);	// @ (0x1C8C * 8 + 7)
#define                                 NVMADR7_bit         _BIT_ACCESS(NVMADRL,7)
// NVMADRH<NVMADR8>
extern volatile __bit                   NVMADR8             __at(0xE468);	// @ (0x1C8D * 8 + 0)
#define                                 NVMADR8_bit         _BIT_ACCESS(NVMADRH,0)
// NVMADRH<NVMADR9>
extern volatile __bit                   NVMADR9             __at(0xE469);	// @ (0x1C8D * 8 + 1)
#define                                 NVMADR9_bit         _BIT_ACCESS(NVMADRH,1)
// NVMDATL<NVMDAT0>
extern volatile __bit                   NVMDAT0             __at(0xE470);	// @ (0x1C8E * 8 + 0)
#define                                 NVMDAT0_bit         _BIT_ACCESS(NVMDATL,0)
// NVMDATL<NVMDAT1>
extern volatile __bit                   NVMDAT1             __at(0xE471);	// @ (0x1C8E * 8 + 1)
#define                                 NVMDAT1_bit         _BIT_ACCESS(NVMDATL,1)
// NVMDATH<NVMDAT10>
extern volatile __bit                   NVMDAT10            __at(0xE47A);	// @ (0x1C8F * 8 + 2)
#define                                 NVMDAT10_bit        _BIT_ACCESS(NVMDATH,2)
// NVMDATH<NVMDAT11>
extern volatile __bit                   NVMDAT11            __at(0xE47B);	// @ (0x1C8F * 8 + 3)
#define                                 NVMDAT11_bit        _BIT_ACCESS(NVMDATH,3)
// NVMDATH<NVMDAT12>
extern volatile __bit                   NVMDAT12            __at(0xE47C);	// @ (0x1C8F * 8 + 4)
#define                                 NVMDAT12_bit        _BIT_ACCESS(NVMDATH,4)
// NVMDATH<NVMDAT13>
extern volatile __bit                   NVMDAT13            __at(0xE47D);	// @ (0x1C8F * 8 + 5)
#define                                 NVMDAT13_bit        _BIT_ACCESS(NVMDATH,5)
// NVMDATL<NVMDAT2>
extern volatile __bit                   NVMDAT2             __at(0xE472);	// @ (0x1C8E * 8 + 2)
#define                                 NVMDAT2_bit         _BIT_ACCESS(NVMDATL,2)
// NVMDATL<NVMDAT3>
extern volatile __bit                   NVMDAT3             __at(0xE473);	// @ (0x1C8E * 8 + 3)
#define                                 NVMDAT3_bit         _BIT_ACCESS(NVMDATL,3)
// NVMDATL<NVMDAT4>
extern volatile __bit                   NVMDAT4             __at(0xE474);	// @ (0x1C8E * 8 + 4)
#define                                 NVMDAT4_bit         _BIT_ACCESS(NVMDATL,4)
// NVMDATL<NVMDAT5>
extern volatile __bit                   NVMDAT5             __at(0xE475);	// @ (0x1C8E * 8 + 5)
#define                                 NVMDAT5_bit         _BIT_ACCESS(NVMDATL,5)
// NVMDATL<NVMDAT6>
extern volatile __bit                   NVMDAT6             __at(0xE476);	// @ (0x1C8E * 8 + 6)
#define                                 NVMDAT6_bit         _BIT_ACCESS(NVMDATL,6)
// NVMDATL<NVMDAT7>
extern volatile __bit                   NVMDAT7             __at(0xE477);	// @ (0x1C8E * 8 + 7)
#define                                 NVMDAT7_bit         _BIT_ACCESS(NVMDATL,7)
// NVMDATH<NVMDAT8>
extern volatile __bit                   NVMDAT8             __at(0xE478);	// @ (0x1C8F * 8 + 0)
#define                                 NVMDAT8_bit         _BIT_ACCESS(NVMDATH,0)
// NVMDATH<NVMDAT9>
extern volatile __bit                   NVMDAT9             __at(0xE479);	// @ (0x1C8F * 8 + 1)
#define                                 NVMDAT9_bit         _BIT_ACCESS(NVMDATH,1)
// PIE1<NVMIE>
extern volatile __bit                   NVMIE               __at(0x4B8);	// @ (0x97 * 8 + 0)
#define                                 NVMIE_bit           _BIT_ACCESS(PIE1,0)
// PIR1<NVMIF>
extern volatile __bit                   NVMIF               __at(0x468);	// @ (0x8D * 8 + 0)
#define                                 NVMIF_bit           _BIT_ACCESS(PIR1,0)
// PMD0<NVMMD>
extern volatile __bit                   NVMMD               __at(0x860);	// @ (0x10C * 8 + 0)
#define                                 NVMMD_bit           _BIT_ACCESS(PMD0,0)
// NVMCON1<NVMREGS>
extern volatile __bit                   NVMREGS             __at(0xE486);	// @ (0x1C90 * 8 + 6)
#define                                 NVMREGS_bit         _BIT_ACCESS(NVMCON1,6)
// ODCONA<ODCA0>
extern volatile __bit                   ODCA0               __at(0xF470);	// @ (0x1E8E * 8 + 0)
#define                                 ODCA0_bit           _BIT_ACCESS(ODCONA,0)
// ODCONA<ODCA1>
extern volatile __bit                   ODCA1               __at(0xF471);	// @ (0x1E8E * 8 + 1)
#define                                 ODCA1_bit           _BIT_ACCESS(ODCONA,1)
// ODCONA<ODCA2>
extern volatile __bit                   ODCA2               __at(0xF472);	// @ (0x1E8E * 8 + 2)
#define                                 ODCA2_bit           _BIT_ACCESS(ODCONA,2)
// ODCONA<ODCA4>
extern volatile __bit                   ODCA4               __at(0xF474);	// @ (0x1E8E * 8 + 4)
#define                                 ODCA4_bit           _BIT_ACCESS(ODCONA,4)
// ODCONA<ODCA5>
extern volatile __bit                   ODCA5               __at(0xF475);	// @ (0x1E8E * 8 + 5)
#define                                 ODCA5_bit           _BIT_ACCESS(ODCONA,5)
// ODCONC<ODCC0>
extern volatile __bit                   ODCC0               __at(0xF510);	// @ (0x1EA2 * 8 + 0)
#define                                 ODCC0_bit           _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCC1>
extern volatile __bit                   ODCC1               __at(0xF511);	// @ (0x1EA2 * 8 + 1)
#define                                 ODCC1_bit           _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCC2>
extern volatile __bit                   ODCC2               __at(0xF512);	// @ (0x1EA2 * 8 + 2)
#define                                 ODCC2_bit           _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCC3>
extern volatile __bit                   ODCC3               __at(0xF513);	// @ (0x1EA2 * 8 + 3)
#define                                 ODCC3_bit           _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCC4>
extern volatile __bit                   ODCC4               __at(0xF514);	// @ (0x1EA2 * 8 + 4)
#define                                 ODCC4_bit           _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCC5>
extern volatile __bit                   ODCC5               __at(0xF515);	// @ (0x1EA2 * 8 + 5)
#define                                 ODCC5_bit           _BIT_ACCESS(ODCONC,5)
// DAC1CON<OE0>
extern volatile __bit                   OE0                 __at(0x4464);	// @ (0x88C * 8 + 4)
#define                                 OE0_bit             _BIT_ACCESS(DAC1CON,4)
// DAC1CON<OE1>
extern volatile __bit                   OE1                 __at(0x4465);	// @ (0x88C * 8 + 5)
#define                                 OE1_bit             _BIT_ACCESS(DAC1CON,5)
// OSCCON3<ORDY>
extern volatile __bit                   ORDY                __at(0x147C);	// @ (0x28F * 8 + 4)
#define                                 ORDY_bit            _BIT_ACCESS(OSCCON3,4)
// PIE1<OSFIE>
extern volatile __bit                   OSFIE               __at(0x4BD);	// @ (0x97 * 8 + 5)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE1,5)
// PIR1<OSFIF>
extern volatile __bit                   OSFIF               __at(0x46D);	// @ (0x8D * 8 + 5)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR1,5)
// CRCOUTL<OUT0>
extern volatile __bit                   OUT0                __at(0xE4F0);	// @ (0x1C9E * 8 + 0)
#define                                 OUT0_bit            _BIT_ACCESS(CRCOUTL,0)
// CRCOUTL<OUT1>
extern volatile __bit                   OUT1                __at(0xE4F1);	// @ (0x1C9E * 8 + 1)
#define                                 OUT1_bit            _BIT_ACCESS(CRCOUTL,1)
// CRCOUTH<OUT10>
extern volatile __bit                   OUT10               __at(0xE4FA);	// @ (0x1C9F * 8 + 2)
#define                                 OUT10_bit           _BIT_ACCESS(CRCOUTH,2)
// CRCOUTH<OUT11>
extern volatile __bit                   OUT11               __at(0xE4FB);	// @ (0x1C9F * 8 + 3)
#define                                 OUT11_bit           _BIT_ACCESS(CRCOUTH,3)
// CRCOUTH<OUT12>
extern volatile __bit                   OUT12               __at(0xE4FC);	// @ (0x1C9F * 8 + 4)
#define                                 OUT12_bit           _BIT_ACCESS(CRCOUTH,4)
// CRCOUTH<OUT13>
extern volatile __bit                   OUT13               __at(0xE4FD);	// @ (0x1C9F * 8 + 5)
#define                                 OUT13_bit           _BIT_ACCESS(CRCOUTH,5)
// CRCOUTH<OUT14>
extern volatile __bit                   OUT14               __at(0xE4FE);	// @ (0x1C9F * 8 + 6)
#define                                 OUT14_bit           _BIT_ACCESS(CRCOUTH,6)
// CRCOUTH<OUT15>
extern volatile __bit                   OUT15               __at(0xE4FF);	// @ (0x1C9F * 8 + 7)
#define                                 OUT15_bit           _BIT_ACCESS(CRCOUTH,7)
// CRCOUTU<OUT16>
extern volatile __bit                   OUT16               __at(0xE500);	// @ (0x1CA0 * 8 + 0)
#define                                 OUT16_bit           _BIT_ACCESS(CRCOUTU,0)
// CRCOUTU<OUT17>
extern volatile __bit                   OUT17               __at(0xE501);	// @ (0x1CA0 * 8 + 1)
#define                                 OUT17_bit           _BIT_ACCESS(CRCOUTU,1)
// CRCOUTU<OUT18>
extern volatile __bit                   OUT18               __at(0xE502);	// @ (0x1CA0 * 8 + 2)
#define                                 OUT18_bit           _BIT_ACCESS(CRCOUTU,2)
// CRCOUTU<OUT19>
extern volatile __bit                   OUT19               __at(0xE503);	// @ (0x1CA0 * 8 + 3)
#define                                 OUT19_bit           _BIT_ACCESS(CRCOUTU,3)
// CRCOUTL<OUT2>
extern volatile __bit                   OUT2                __at(0xE4F2);	// @ (0x1C9E * 8 + 2)
#define                                 OUT2_bit            _BIT_ACCESS(CRCOUTL,2)
// CRCOUTU<OUT20>
extern volatile __bit                   OUT20               __at(0xE504);	// @ (0x1CA0 * 8 + 4)
#define                                 OUT20_bit           _BIT_ACCESS(CRCOUTU,4)
// CRCOUTU<OUT21>
extern volatile __bit                   OUT21               __at(0xE505);	// @ (0x1CA0 * 8 + 5)
#define                                 OUT21_bit           _BIT_ACCESS(CRCOUTU,5)
// CRCOUTU<OUT22>
extern volatile __bit                   OUT22               __at(0xE506);	// @ (0x1CA0 * 8 + 6)
#define                                 OUT22_bit           _BIT_ACCESS(CRCOUTU,6)
// CRCOUTU<OUT23>
extern volatile __bit                   OUT23               __at(0xE507);	// @ (0x1CA0 * 8 + 7)
#define                                 OUT23_bit           _BIT_ACCESS(CRCOUTU,7)
// CRCOUTT<OUT24>
extern volatile __bit                   OUT24               __at(0xE508);	// @ (0x1CA1 * 8 + 0)
#define                                 OUT24_bit           _BIT_ACCESS(CRCOUTT,0)
// CRCOUTT<OUT25>
extern volatile __bit                   OUT25               __at(0xE509);	// @ (0x1CA1 * 8 + 1)
#define                                 OUT25_bit           _BIT_ACCESS(CRCOUTT,1)
// CRCOUTT<OUT26>
extern volatile __bit                   OUT26               __at(0xE50A);	// @ (0x1CA1 * 8 + 2)
#define                                 OUT26_bit           _BIT_ACCESS(CRCOUTT,2)
// CRCOUTT<OUT27>
extern volatile __bit                   OUT27               __at(0xE50B);	// @ (0x1CA1 * 8 + 3)
#define                                 OUT27_bit           _BIT_ACCESS(CRCOUTT,3)
// CRCOUTT<OUT28>
extern volatile __bit                   OUT28               __at(0xE50C);	// @ (0x1CA1 * 8 + 4)
#define                                 OUT28_bit           _BIT_ACCESS(CRCOUTT,4)
// CRCOUTT<OUT29>
extern volatile __bit                   OUT29               __at(0xE50D);	// @ (0x1CA1 * 8 + 5)
#define                                 OUT29_bit           _BIT_ACCESS(CRCOUTT,5)
// CRCOUTL<OUT3>
extern volatile __bit                   OUT3                __at(0xE4F3);	// @ (0x1C9E * 8 + 3)
#define                                 OUT3_bit            _BIT_ACCESS(CRCOUTL,3)
// CRCOUTT<OUT30>
extern volatile __bit                   OUT30               __at(0xE50E);	// @ (0x1CA1 * 8 + 6)
#define                                 OUT30_bit           _BIT_ACCESS(CRCOUTT,6)
// CRCOUTT<OUT31>
extern volatile __bit                   OUT31               __at(0xE50F);	// @ (0x1CA1 * 8 + 7)
#define                                 OUT31_bit           _BIT_ACCESS(CRCOUTT,7)
// CRCOUTL<OUT4>
extern volatile __bit                   OUT4                __at(0xE4F4);	// @ (0x1C9E * 8 + 4)
#define                                 OUT4_bit            _BIT_ACCESS(CRCOUTL,4)
// CRCOUTL<OUT5>
extern volatile __bit                   OUT5                __at(0xE4F5);	// @ (0x1C9E * 8 + 5)
#define                                 OUT5_bit            _BIT_ACCESS(CRCOUTL,5)
// CRCOUTL<OUT6>
extern volatile __bit                   OUT6                __at(0xE4F6);	// @ (0x1C9E * 8 + 6)
#define                                 OUT6_bit            _BIT_ACCESS(CRCOUTL,6)
// CRCOUTL<OUT7>
extern volatile __bit                   OUT7                __at(0xE4F7);	// @ (0x1C9E * 8 + 7)
#define                                 OUT7_bit            _BIT_ACCESS(CRCOUTL,7)
// CRCOUTH<OUT8>
extern volatile __bit                   OUT8                __at(0xE4F8);	// @ (0x1C9F * 8 + 0)
#define                                 OUT8_bit            _BIT_ACCESS(CRCOUTH,0)
// CRCOUTH<OUT9>
extern volatile __bit                   OUT9                __at(0xE4F9);	// @ (0x1C9F * 8 + 1)
#define                                 OUT9_bit            _BIT_ACCESS(CRCOUTH,1)
// CWG1STR<OVRA>
extern volatile __bit                   OVRA                __at(0x30A4);	// @ (0x614 * 8 + 4)
#define                                 OVRA_bit            _BIT_ACCESS(CWG1STR,4)
// CWG1STR<OVRB>
extern volatile __bit                   OVRB                __at(0x30A5);	// @ (0x614 * 8 + 5)
#define                                 OVRB_bit            _BIT_ACCESS(CWG1STR,5)
// CWG1STR<OVRC>
extern volatile __bit                   OVRC                __at(0x30A6);	// @ (0x614 * 8 + 6)
#define                                 OVRC_bit            _BIT_ACCESS(CWG1STR,6)
// CWG1STR<OVRD>
extern volatile __bit                   OVRD                __at(0x30A7);	// @ (0x614 * 8 + 7)
#define                                 OVRD_bit            _BIT_ACCESS(CWG1STR,7)
// CCP1CON<P1M1>
extern volatile __bit                   P1M1                __at(0x2077);	// @ (0x40E * 8 + 7)
#define                                 P1M1_bit            _BIT_ACCESS(CCP1CON,7)
// CCP2CON<P2M1>
extern volatile __bit                   P2M1                __at(0x2097);	// @ (0x412 * 8 + 7)
#define                                 P2M1_bit            _BIT_ACCESS(CCP2CON,7)
// ADPCH<PCH3>
extern volatile __bit                   PCH3                __at(0xE8FB);	// @ (0x1D1F * 8 + 3)
#define                                 PCH3_bit            _BIT_ACCESS(ADPCH,3)
// ADPCH<PCH4>
extern volatile __bit                   PCH4                __at(0xE8FC);	// @ (0x1D1F * 8 + 4)
#define                                 PCH4_bit            _BIT_ACCESS(ADPCH,4)
// ADPCH<PCH5>
extern volatile __bit                   PCH5                __at(0xE8FD);	// @ (0x1D1F * 8 + 5)
#define                                 PCH5_bit            _BIT_ACCESS(ADPCH,5)
// ADCON1<PCSC>
extern volatile __bit                   PCSC                __at(0xE939);	// @ (0x1D27 * 8 + 1)
#define                                 PCSC_bit            _BIT_ACCESS(ADCON1,1)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN1>
extern volatile __bit                   PEN1                __at(0x3C8A);	// @ (0x791 * 8 + 2)
#define                                 PEN1_bit            _BIT_ACCESS(SSP1CON2,2)
// SSP2CON2<PEN2>
extern volatile __bit                   PEN2                __at(0x3CDA);	// @ (0x79B * 8 + 2)
#define                                 PEN2_bit            _BIT_ACCESS(SSP2CON2,2)
// NCO1CON<PFM>
extern volatile __bit                   PFM                 __at(0x2C90);	// @ (0x592 * 8 + 0)
#define                                 PFM_bit             _BIT_ACCESS(NCO1CON,0)
// CRCCON1<PLEN0>
extern volatile __bit                   PLEN0               __at(0xE518);	// @ (0x1CA3 * 8 + 0)
#define                                 PLEN0_bit           _BIT_ACCESS(CRCCON1,0)
// CRCCON1<PLEN1>
extern volatile __bit                   PLEN1               __at(0xE519);	// @ (0x1CA3 * 8 + 1)
#define                                 PLEN1_bit           _BIT_ACCESS(CRCCON1,1)
// CRCCON1<PLEN2>
extern volatile __bit                   PLEN2               __at(0xE51A);	// @ (0x1CA3 * 8 + 2)
#define                                 PLEN2_bit           _BIT_ACCESS(CRCCON1,2)
